In [2]:
import requests
import json
import pandas as pd
from IPython.display import display

In [3]:
request = requests.get('https://www.inegi.org.mx/app/api/indicadores/desarrolladores/jsonxml/INDICATOR/1003000011,1003000017,1003000018,1003000019/es/07000019/false/BISE/2.0/2d3b705b-34c4-a90d-5395-960213edd06d?type=json')

In [4]:
data = request.json()

In [7]:
indicadores = data['Series']
for indicador in indicadores:
  print(indicador['INDICADOR'])
  df = pd.DataFrame.from_dict(indicador['OBSERVATIONS'])
  display(df)

1003000011

,TIME_PERIOD,OBS_VALUE,OBS_EXCEPTION,OBS_STATUS,OBS_SOURCE,OBS_NOTE,COBER_GEO
0,1995,790941.00000000000000000000,None,3,,422,07000019
1,2000,878600.00000000000000000000,None,3,,9,07000019
2,2005,994983.00000000000000000000,None,3,,49,07000019
3,2010,1191114.00000000000000000000,None,3,,115,07000019
4,2020,1545418.00000000000000000000,None,3,,,07000019

1003000017

,TIME_PERIOD,OBS_VALUE,OBS_EXCEPTION,OBS_STATUS,OBS_SOURCE,OBS_NOTE,COBER_GEO
0,1995,773725.00000000000000000000,None,3,,422,07000019
1,2000,865650.00000000000000000000,None,3,,9,07000019
2,2005,976487.00000000000000000000,None,3,,49,07000019
3,2010,1170401.00000000000000000000,None,3,,115,07000019
4,2020,1645742.00000000000000000000,None,3,,,07000019

1003000018

,TIME_PERIOD,OBS_VALUE,OBS_EXCEPTION,OBS_STATUS,OBS_SOURCE,OBS_NOTE,COBER_GEO
0,1995,733238.00000000000000000000,None,3,,422,07000019
1,2000,821797.00000000000000000000,None,3,,9,07000019
2,2005,940833.00000000000000000000,None,3,,49,07000019
3,2010,1135248.00000000000000000000,None,3,,115,07000019
4,2020,1636431.00000000000000000000,None,3,,,07000019

1003000019

,TIME_PERIOD,OBS_VALUE,OBS_EXCEPTION,OBS_STATUS,OBS_SOURCE,OBS_NOTE,COBER_GEO
0,1995,700973.00000000000000000000,None,3,,422,07000019
1,2000,797564.00000000000000000000,None,3,,9,07000019
2,2005,945767.00000000000000000000,None,3,,49,07000019
3,2010,1139112.00000000000000000000,None,3,,115,07000019
4,2020,1633334.00000000000000000000,None,3,,,07000019

In [ ]:
INDICATOR = [1003000011,1003000017,1003000018,1003000019]

In [ ]:
print(INDICATOR[0],",",INDICATOR[1],",",INDICATOR[2],",",INDICATOR[3])

1003000011 , 1003000017 , 1003000018 , 1003000019